In [4]:
# Import related packages

import numpy as np
import pandas as pd

In [ ]:
# Related data

A1 = pd.DataFrame([[12, np.nan, 23, 25 ],
                   [18, None, 52, 34 ],
                   [np.nan, 14, 39, None],
                   [37, 76, 19, 10 ],
                   [47, 66, 29, 1 ]])

C1_index = [('California', 2000), ('California', 2010),
            ('New York', 2000), ('New York', 2010),
            ('Texas', 2000), ('Texas', 2010)]

populations = [33871648, 37253956, 18976457, 19378102, 20851820, 25145561]

C1 = pd.Series(populations, index=C1_index)

Data = np.round(np.random.randn(4, 6), 1)
Data[:, ::2] *= 10
Data += 37

H1=pd.DataFrame([['A1','B1','C1'],['A2','B2','C2']], index=['1','2'], columns=['A','B','C'])
H2=pd.DataFrame([['B3','C3','D3'],['B4','C4','D4']], index=['1','2'], columns=['B','C','D'])

# Q1: Detecting and droping null values

- a. print A1
- b. detecting null values in A1
- c. drop the rows which contain null in A1
- d. drop the columns which contain null in A1
- e. Keep minimum 4 non-NA entries column-wise

In [24]:
A1 = pd.DataFrame([[12, np.nan, 23, 25 ],
                   [18, None, 52, 34 ],
                   [np.nan, 14, 39, None],
                   [37, 76, 19, 10 ],
                   [47, 66, 29, 1 ]],
                 columns=list('ABCD'))

In [143]:
# a.

      A     B   C     D
0  12.0   NaN  23  25.0
1  18.0   NaN  52  34.0
2   NaN  14.0  39   NaN
3  37.0  76.0  19  10.0
4  47.0  66.0  29   1.0

In [144]:
# b.detecting null values in A1

       A      B      C      D
0  False   True  False  False
1  False   True  False  False
2   True  False  False   True
3  False  False  False  False
4  False  False  False  False

In [27]:
# c. drop the rows which contain null in A1

      A     B   C     D
3  37.0  76.0  19  10.0
4  47.0  66.0  29   1.0

In [28]:
# d. drop the columns which contain null in A1

    C
0  23
1  52
2  39
3  19
4  29

In [29]:
# e. Keep minimum 4 non-NA entries column-wise

      A   C     D
0  12.0  23  25.0
1  18.0  52  34.0
2   NaN  39   NaN
3  37.0  19  10.0
4  47.0  29   1.0

# Q2: Filling null values

- a. print A1
- b. Replace all NaN elements in column 'A', 'B', 'C', and 'D', with 0, 1, 2, and 3 respectively. hint (use value parameter)
- c. Only replace the first NaN element. by default it is column-wise. (hint: use value and limit parameters)
- d. forward-fill the previous value by axis 1

In [30]:
# a. print A1

      A     B   C     D
0  12.0   NaN  23  25.0
1  18.0   NaN  52  34.0
2   NaN  14.0  39   NaN
3  37.0  76.0  19  10.0
4  47.0  66.0  29   1.0

In [40]:
# b. Replace all NaN elements in column 'A', 'B', 'C', and 'D', with 0, 1, 2, and 3 respectively.
# hint (use value parameter)

      A     B   C     D
0  12.0   1.0  23  25.0
1  18.0   1.0  52  34.0
2   0.0  14.0  39   3.0
3  37.0  76.0  19  10.0
4  47.0  66.0  29   1.0

In [45]:
# c. Only replace the first NaN element. by default it is column-wise. (hint: use value and limit parameters)

      A     B   C     D
0  12.0   1.0  23  25.0
1  18.0   NaN  52  34.0
2   0.0  14.0  39   3.0
3  37.0  76.0  19  10.0
4  47.0  66.0  29   1.0

In [46]:
# d. forward-fill the previous value by axis 1

      A     B     C     D
0  12.0  12.0  23.0  25.0
1  18.0  18.0  52.0  34.0
2   NaN  14.0  39.0  39.0
3  37.0  76.0  19.0  10.0
4  47.0  66.0  29.0   1.0

# Q3: MultiIndex as extra dimension

- a. print C1
- b. print C1_index
- c. convert C1_index as Pandas MultiIndex type
- d. re-index the C1 with C1_index, then name as C1d
- e. use unstack way to convert C1d, then name as C1e
- f. use stack way to convert C1e, then name as C1f

In [68]:
# Run before the start of answering question 3

C1_index = [('California', 2000), ('California', 2010),
            ('New York', 2000), ('New York', 2010),
            ('Texas', 2000), ('Texas', 2010)]


populations = [33871648, 37253956, 18976457, 19378102, 20851820, 25145561]

In [69]:
# a. print C1
# That is a Series multi-indexing

C1 = pd.Series(populations, index=C1_index)

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [70]:
# b. print C1_index

[('California', 2000), ('California', 2010), ('New York', 2000), ('New York', 2010), ('Texas', 2000), ('Texas', 2010)]

In [71]:
# c. convert C1_index as Pandas MultiIndex type

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [72]:
# d. re-index the C1 with C1_index, then name as C1d

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [74]:
# e. use unstack way to convert C1d, then name as C1e

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [76]:
# f. use stack way to convert C1e, then name as C1f

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

# Q4: MultiIndex for columns

- a. create "row_index" by MultiIndex.from_product which contain
        levels=[[2013, 2014], [1, 2]],
        names=['year', 'visit']

- b. create "column_index" by MultiIndex.from_product which contain
        levels=[['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
        names=['patient', 'measurement']

- c. combine "row_index", "column_index" and Data by pd.DataFrame as D2

In [147]:
# a.

MultiIndex([(2013, 1),
            (2013, 2),
            (2014, 1),
            (2014, 2)],
           names=['year', 'visit'])

In [148]:
# b.

MultiIndex([(  'Bob',   'HR'),
            (  'Bob', 'Temp'),
            ('Guido',   'HR'),
            ('Guido', 'Temp'),
            (  'Sue',   'HR'),
            (  'Sue', 'Temp')],
           names=['patient', 'measurement'])

In [149]:
# Run before answering Question 4c.

[[47.  35.3 30.5 33.8 40.4 35.4]
 [36.  36.7 33.8 35.2 44.8 35. ]
 [17.3 35.5 39.3 35.  31.6 37.2]
 [23.9 36.4 11.8 36.5 30.5 36.2]]

In [150]:
# c. combine "row_index", "column_index" and D1 by pd.DataFrame as D2

patient       Bob       Guido         Sue
measurement    HR  Temp    HR  Temp    HR  Temp
year visit
2013 1       47.0  35.3  30.5  33.8  40.4  35.4
     2       36.0  36.7  33.8  35.2  44.8  35.0
2014 1       17.3  35.5  39.3  35.0  31.6  37.2
     2       23.9  36.4  11.8  36.5  30.5  36.2

# Q5: Multiple index DataFrames

- a. print D2
- b. select 'Sue' column from D2
- c. select 'HR' column in 'Sue' column from D2
- d. select '2014' row and 'Guido' column from D2. (using iloc)
- e. select '2013' row and 'HR' column in 'Guido' column from D2. (using loc)
- f. select 'visit'=2 row and 'Temp' column from D2. (recall loc and idx)

In [94]:
# a.

patient       Bob       Guido         Sue
measurement    HR  Temp    HR  Temp    HR  Temp
year visit
2013 1       47.0  36.2  17.3  37.1  48.1  35.9
     2       20.6  36.8  52.5  36.1  21.7  37.5
2014 1       34.9  35.0  29.4  34.4  31.6  36.5
     2       56.9  36.0  54.7  36.2  25.0  36.0

In [97]:
# b. select 'Sue' column from D2

measurement    HR  Temp
year visit
2013 1       48.1  35.9
     2       21.7  37.5
2014 1       31.6  36.5
     2       25.0  36.0

In [98]:
# c. select 'HR' column in 'Sue' column from D2

year  visit
2013  1        48.1
      2        21.7
2014  1        31.6
      2        25.0
Name: (Sue, HR), dtype: float64

In [100]:
# d. select '2014' row and 'Guido' column from D2. (using iloc)

patient     Guido
measurement    HR  Temp
year visit
2014 1       29.4  34.4
     2       54.7  36.2

In [107]:
# e. select '2013' row and 'HR' column in 'Guido' column from D2. (using loc)

visit
1    17.3
2    52.5
Name: (Guido, HR), dtype: float64

In [110]:
# f. select 'visit'=2 row and 'Temp' column from D2. (recall loc and idx)

patient       Bob Guido   Sue
measurement  Temp  Temp  Temp
year visit
2013 2       36.8  36.1  37.5
2014 2       36.0  36.2  36.0

# Q6: Data Aggregations on Multi-Indices

- a. print D2
- b. take the sum among levels on the visit row
- c. take the sum among levels on the patient column

In [113]:
# a.

patient       Bob       Guido         Sue
measurement    HR  Temp    HR  Temp    HR  Temp
year visit
2013 1       47.0  36.2  17.3  37.1  48.1  35.9
     2       20.6  36.8  52.5  36.1  21.7  37.5
2014 1       34.9  35.0  29.4  34.4  31.6  36.5
     2       56.9  36.0  54.7  36.2  25.0  36.0

In [118]:
# b. take the sum among levels on the visit row

patient       Bob        Guido         Sue
measurement    HR  Temp     HR  Temp    HR  Temp
visit
1            81.9  71.2   46.7  71.5  79.7  72.4
2            77.5  72.8  107.2  72.3  46.7  73.5

In [119]:
# c. take the sum among levels on the patient column

patient      Bob  Guido   Sue
year visit
2013 1      83.2   54.4  84.0
     2      57.4   88.6  59.2
2014 1      69.9   63.8  68.1
     2      92.9   90.9  61.0

# Q7: Simple Concatenation with pd.concat

- a. print E1
- b. print E2
- c. concat E1 and E2 by row
- d. fix the duplicate indices problem on c (hint: use ignore_index)
- e. concat E1 and E2 by column

In [137]:
E1=pd.DataFrame([['A1','B1','C1'],['A2','B2','C2']], index=['1','2'], columns=['A','B','C'])

E2=pd.DataFrame([['B3','C3','D3'],['B4','C4','D4']], index=['1','2'], columns=['B','C','D'])

In [138]:
# a.

    A   B   C
1  A1  B1  C1
2  A2  B2  C2

In [139]:
# b.

    B   C   D
1  B3  C3  D3
2  B4  C4  D4

In [140]:
# c.

     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
1  NaN  B3  C3   D3
2  NaN  B4  C4   D4

In [141]:
# d.

     A   B   C    D
0   A1  B1  C1  NaN
1   A2  B2  C2  NaN
2  NaN  B3  C3   D3
3  NaN  B4  C4   D4

In [142]:
# concat H1 and H2 by column

    A   B   C   B   C   D
1  A1  B1  C1  B3  C3  D3
2  A2  B2  C2  B4  C4  D4